ГТС/УТГТС/InformationRegisters/КоммерческиеПредложенияПоЗапросам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КоммерческиеПредложенияПоЗапросам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ЗапросКоммерческихПредложений</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗапросКоммерческихПредложенийПоставщиков</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КоммерческоеПредложениеПоставщика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоммерческоеПредложениеПоставщика</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/КоммерческиеПредложенияПоЗапросам/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Процедура выполняет привязку КП к ЗКП
//
Процедура СопоставитьПоступившееПредложение(Знач ЗапросКоммерческихПредложений, Знач КоммерческоеПредложениеПоставщика) Экспорт
	
	Если Не ЗначениеЗаполнено(ЗапросКоммерческихПредложений)
			Или Не ЗначениеЗаполнено(КоммерческоеПредложениеПоставщика) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
		
		МенеджерЗаписи = РегистрыСведений.КоммерческиеПредложенияПоЗапросам.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ЗапросКоммерческихПредложений = ЗапросКоммерческихПредложений;
		МенеджерЗаписи.КоммерческоеПредложениеПоставщика = КоммерческоеПредложениеПоставщика;
		МенеджерЗаписи.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Информация = ИнформацияОбОшибке();
		
		ЭлектронноеВзаимодействие.ОбработатьОшибку(НСтр("ru = 'Сопоставление поступившего предложения с запросом КП'"), ПодробноеПредставлениеОшибки(Информация));
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
